NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l05/nrf54l05_global.h
#ifdef NRF_TRUSTZONE_NONSECURE                       /*!< Remap NRF_X_NS instances to NRF_X symbol for ease of use.            */
  #define NRF_FICR                                NRF_FICR_NS
  #define NRF_DPPIC00                             NRF_DPPIC00_NS
  #define NRF_PPIB00                              NRF_PPIB00_NS
  #define NRF_PPIB01                              NRF_PPIB01_NS
  #define NRF_AAR00                               NRF_AAR00_NS
  #define NRF_CCM00                               NRF_CCM00_NS
  #define NRF_ECB00                               NRF_ECB00_NS
  #define NRF_SPIM00                              NRF_SPIM00_NS
  #define NRF_SPIS00                              NRF_SPIS00_NS
  #define NRF_UARTE00                             NRF_UARTE00_NS
  #define NRF_VPR00                               NRF_VPR00_NS
  #define NRF_GPIOHSPADCTRL                       NRF_GPIOHSPADCTRL_NS
  #define NRF_P2                                  NRF_P2_NS
  #define NRF_CTRLAP                              NRF_CTRLAP_NS
  #define NRF_TAD                                 NRF_TAD_NS
  #define NRF_TIMER00                             NRF_TIMER00_NS
  #define NRF_DPPIC10                             NRF_DPPIC10_NS
  #define NRF_PPIB10                              NRF_PPIB10_NS
  #define NRF_PPIB11                              NRF_PPIB11_NS
  #define NRF_TIMER10                             NRF_TIMER10_NS
  #define NRF_EGU10                               NRF_EGU10_NS
  #define NRF_RADIO                               NRF_RADIO_NS
  #define NRF_DPPIC20                             NRF_DPPIC20_NS
  #define NRF_PPIB20                              NRF_PPIB20_NS
  #define NRF_PPIB21                              NRF_PPIB21_NS
  #define NRF_PPIB22                              NRF_PPIB22_NS
  #define NRF_SPIM20                              NRF_SPIM20_NS
  #define NRF_SPIS20                              NRF_SPIS20_NS
  #define NRF_TWIM20                              NRF_TWIM20_NS
  #define NRF_TWIS20                              NRF_TWIS20_NS
  #define NRF_UARTE20                             NRF_UARTE20_NS
  #define NRF_SPIM21                              NRF_SPIM21_NS
  #define NRF_SPIS21                              NRF_SPIS21_NS
  #define NRF_TWIM21                              NRF_TWIM21_NS
  #define NRF_TWIS21                              NRF_TWIS21_NS
  #define NRF_UARTE21                             NRF_UARTE21_NS
  #define NRF_SPIM22                              NRF_SPIM22_NS
  #define NRF_SPIS22                              NRF_SPIS22_NS
  #define NRF_TWIM22                              NRF_TWIM22_NS
  #define NRF_TWIS22                              NRF_TWIS22_NS
  #define NRF_UARTE22                             NRF_UARTE22_NS
  #define NRF_EGU20                               NRF_EGU20_NS
  #define NRF_TIMER20                             NRF_TIMER20_NS
  #define NRF_TIMER21                             NRF_TIMER21_NS
  #define NRF_TIMER22                             NRF_TIMER22_NS
  #define NRF_TIMER23                             NRF_TIMER23_NS
  #define NRF_TIMER24                             NRF_TIMER24_NS
  #define NRF_MEMCONF                             NRF_MEMCONF_NS
  #define NRF_PDM20                               NRF_PDM20_NS
  #define NRF_PDM21                               NRF_PDM21_NS
  #define NRF_PWM20                               NRF_PWM20_NS
  #define NRF_PWM21                               NRF_PWM21_NS
  #define NRF_PWM22                               NRF_PWM22_NS
  #define NRF_SAADC                               NRF_SAADC_NS
  #define NRF_NFCT                                NRF_NFCT_NS
  #define NRF_TEMP                                NRF_TEMP_NS
  #define NRF_P1                                  NRF_P1_NS
  #define NRF_GPIOTE20                            NRF_GPIOTE20_NS
  #define NRF_I2S20                               NRF_I2S20_NS
  #define NRF_QDEC20                              NRF_QDEC20_NS
  #define NRF_QDEC21                              NRF_QDEC21_NS
  #define NRF_GRTC                                NRF_GRTC_NS
  #define NRF_DPPIC30                             NRF_DPPIC30_NS
  #define NRF_PPIB30                              NRF_PPIB30_NS
  #define NRF_SPIM30                              NRF_SPIM30_NS
  #define NRF_SPIS30                              NRF_SPIS30_NS
  #define NRF_TWIM30                              NRF_TWIM30_NS
  #define NRF_TWIS30                              NRF_TWIS30_NS
  #define NRF_UARTE30                             NRF_UARTE30_NS
  #define NRF_COMP                                NRF_COMP_NS
  #define NRF_LPCOMP                              NRF_LPCOMP_NS
  #define NRF_WDT31                               NRF_WDT31_NS
  #define NRF_P0                                  NRF_P0_NS
  #define NRF_GPIOTE30                            NRF_GPIOTE30_NS
  #define NRF_CLOCK                               NRF_CLOCK_NS
  #define NRF_POWER                               NRF_POWER_NS
  #define NRF_RESET                               NRF_RESET_NS
  #define NRF_OSCILLATORS                         NRF_OSCILLATORS_NS
  #define NRF_REGULATORS                          NRF_REGULATORS_NS
#else                                                /*!< Remap NRF_X_S instances to NRF_X symbol for ease of use.             */
  #define NRF_FICR                                NRF_FICR_NS
  #define NRF_UICR                                NRF_UICR_S
  #define NRF_SICR                                NRF_SICR_S
  #define NRF_CRACENCORE                          NRF_CRACENCORE_S
  #define NRF_SPU00                               NRF_SPU00_S
  #define NRF_MPC00                               NRF_MPC00_S
  #define NRF_DPPIC00                             NRF_DPPIC00_S
  #define NRF_PPIB00                              NRF_PPIB00_S
  #define NRF_PPIB01                              NRF_PPIB01_S
  #define NRF_KMU                                 NRF_KMU_S
  #define NRF_AAR00                               NRF_AAR00_S
  #define NRF_CCM00                               NRF_CCM00_S
  #define NRF_ECB00                               NRF_ECB00_S
  #define NRF_CRACEN                              NRF_CRACEN_S
  #define NRF_SPIM00                              NRF_SPIM00_S
  #define NRF_SPIS00                              NRF_SPIS00_S
  #define NRF_UARTE00                             NRF_UARTE00_S
  #define NRF_GLITCHDET                           NRF_GLITCHDET_S
  #define NRF_RRAMC                               NRF_RRAMC_S
  #define NRF_VPR00                               NRF_VPR00_S
  #define NRF_GPIOHSPADCTRL                       NRF_GPIOHSPADCTRL_S
  #define NRF_P2                                  NRF_P2_S
  #define NRF_CTRLAP                              NRF_CTRLAP_S
  #define NRF_TAD                                 NRF_TAD_S
  #define NRF_TIMER00                             NRF_TIMER00_S
  #define NRF_SPU10                               NRF_SPU10_S
  #define NRF_DPPIC10                             NRF_DPPIC10_S
  #define NRF_PPIB10                              NRF_PPIB10_S
  #define NRF_PPIB11                              NRF_PPIB11_S
  #define NRF_TIMER10                             NRF_TIMER10_S
  #define NRF_EGU10                               NRF_EGU10_S
  #define NRF_RADIO                               NRF_RADIO_S
  #define NRF_SPU20                               NRF_SPU20_S
  #define NRF_DPPIC20                             NRF_DPPIC20_S
  #define NRF_PPIB20                              NRF_PPIB20_S
  #define NRF_PPIB21                              NRF_PPIB21_S
  #define NRF_PPIB22                              NRF_PPIB22_S
  #define NRF_SPIM20                              NRF_SPIM20_S
  #define NRF_SPIS20                              NRF_SPIS20_S
  #define NRF_TWIM20                              NRF_TWIM20_S
  #define NRF_TWIS20                              NRF_TWIS20_S
  #define NRF_UARTE20                             NRF_UARTE20_S
  #define NRF_SPIM21                              NRF_SPIM21_S
  #define NRF_SPIS21                              NRF_SPIS21_S
  #define NRF_TWIM21                              NRF_TWIM21_S
  #define NRF_TWIS21                              NRF_TWIS21_S
  #define NRF_UARTE21                             NRF_UARTE21_S
  #define NRF_SPIM22                              NRF_SPIM22_S
  #define NRF_SPIS22                              NRF_SPIS22_S
  #define NRF_TWIM22                              NRF_TWIM22_S
  #define NRF_TWIS22                              NRF_TWIS22_S
  #define NRF_UARTE22                             NRF_UARTE22_S
  #define NRF_EGU20                               NRF_EGU20_S
  #define NRF_TIMER20                             NRF_TIMER20_S
  #define NRF_TIMER21                             NRF_TIMER21_S
  #define NRF_TIMER22                             NRF_TIMER22_S
  #define NRF_TIMER23                             NRF_TIMER23_S
  #define NRF_TIMER24                             NRF_TIMER24_S
  #define NRF_MEMCONF                             NRF_MEMCONF_S
  #define NRF_PDM20                               NRF_PDM20_S
  #define NRF_PDM21                               NRF_PDM21_S
  #define NRF_PWM20                               NRF_PWM20_S
  #define NRF_PWM21                               NRF_PWM21_S
  #define NRF_PWM22                               NRF_PWM22_S
  #define NRF_SAADC                               NRF_SAADC_S
  #define NRF_NFCT                                NRF_NFCT_S
  #define NRF_TEMP                                NRF_TEMP_S
  #define NRF_P1                                  NRF_P1_S
  #define NRF_GPIOTE20                            NRF_GPIOTE20_S
  #define NRF_TAMPC                               NRF_TAMPC_S
  #define NRF_I2S20                               NRF_I2S20_S
  #define NRF_QDEC20                              NRF_QDEC20_S
  #define NRF_QDEC21                              NRF_QDEC21_S
  #define NRF_GRTC                                NRF_GRTC_S
  #define NRF_SPU30                               NRF_SPU30_S
  #define NRF_DPPIC30                             NRF_DPPIC30_S
  #define NRF_PPIB30                              NRF_PPIB30_S
  #define NRF_SPIM30                              NRF_SPIM30_S
  #define NRF_SPIS30                              NRF_SPIS30_S
  #define NRF_TWIM30                              NRF_TWIM30_S
  #define NRF_TWIS30                              NRF_TWIS30_S
  #define NRF_UARTE30                             NRF_UARTE30_S
  #define NRF_COMP                                NRF_COMP_S
  #define NRF_LPCOMP                              NRF_LPCOMP_S
  #define NRF_WDT30                               NRF_WDT30_S
  #define NRF_WDT31                               NRF_WDT31_S
  #define NRF_P0                                  NRF_P0_S
  #define NRF_GPIOTE30                            NRF_GPIOTE30_S
  #define NRF_CLOCK                               NRF_CLOCK_S
  #define NRF_POWER                               NRF_POWER_S
  #define NRF_RESET                               NRF_RESET_S
  #define NRF_OSCILLATORS                         NRF_OSCILLATORS_S
  #define NRF_REGULATORS                          NRF_REGULATORS_S
#endif                                               /*!< NRF_TRUSTZONE_NONSECURE                                              */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF54L05_GLOBAL_H */

